/*
// Абстрактный класс и виртуальный деструктор
Задание 1
Создать абстрактный базовый класс с виртуальной функцией — корни уравнения.Создать производные классы : класс линейных уравнений и класс квадратных уравнений.Определить функцию вычисления корней уравнений.
// custom task:
Создать массив указателей на базовый класс и заполнить его объектами производных классов.Вывести на экран корни уравнений.
//////////////////////////
Задание 2
Создайте абстрактный класс Shape для рисования плоских фигур.Определите виртуальные методы :

Show() — вывод на экран информации о фигуре,
Save() — сохранение фигуры в файл,
Load() — считывание фигуры из файла.
Определите производные классы :

Square — квадрат, который характеризуется координатами левого верхнего угла и длиной стороны
Rectangle — прямоугольник с заданными координатами верхнего левого угла и размерами
Circle — окружность с заданными координатами центра и радиусом
Ellipse — эллипс с заданными координатами верхнего угла описанного вокруг него прямоугольника со сторонами, параллельными осям координат, и размерами этого прямоугольника.
Создайте массив фигур, сохраните фигуры в файл, загрузите в другой массив и отобразите информацию о каждой из фигур.

*/



#include <iostream>
using namespace std;

int main()
{







}

